art-den/co2meter/firmware/src/stm32_lib/hl_tim.hpp
#pragma once

#include <stdint.h>
#include "hl_device.hpp"

namespace hl {

// fwd.
namespace detailed {
	template <unsigned N> struct TimerHelper;
	template <unsigned N> struct TimerChanHelper;
}

///////////////////////////////////////////////////////////////////////////////

enum class TimMasterMode
{
	Reset  = 0 << 4,
	Enable = 1 << 4,
	Update = 2 << 4
};

template <unsigned N>
class BasicTimer : public Device<detailed::TimerHelper<N>>
{
public:
	typedef detailed::TimerHelper<N> Helper;

	static constexpr IRQn_Type IRQn = Helper::IRQn;


	static void enable_auto_reload_preload()
	{
		set_periph_reg_bit<TIM_CR1, TIM_CR1_ARPE>();
	}

	static void disable_auto_reload_preload()
	{
		clear_periph_reg_bit<TIM_CR1, TIM_CR1_ARPE>();
	}

	static void enable_one_pulse_mode()
	{
		set_periph_reg_bit<TIM_CR1, TIM_CR1_OPM>();
	}

	static void disable_one_pulse_mode()
	{
		clear_periph_reg_bit<TIM_CR1, TIM_CR1_OPM>();
	}

	static void generate_update()
	{
		HL_UI32REG(TIM_EGR) = TIM_EGR_UG;
	}

	// CR1_URS ???
	// CR1_UDIS ???

	static void start()
	{
		set_periph_reg_bit<TIM_CR1, TIM_CR1_CEN>();
	}

	static bool is_started()
	{
		return get_periph_reg_bit<TIM_CR1, TIM_CR1_CEN>();
	}

	static void stop()
	{
		clear_periph_reg_bit<TIM_CR1, TIM_CR1_CEN>();
		__DSB();
		__NOP();
	}

	static void set_master_mode(TimMasterMode mode)
	{
		set_value_by_mask<uint32_t>(TIM_CR2, TIM_CR2_MMS, (uint32_t)mode);
	}

	static void enable_update_dma_request()
	{
		set_periph_reg_bit<TIM_DIER, TIM_DIER_UDE>();
	}

	static void disable_update_dma_request()
	{
		clear_periph_reg_bit<TIM_DIER, TIM_DIER_UDE>();
	}

	static void enable_update_interrupt()
	{
		set_periph_reg_bit<TIM_DIER, TIM_DIER_UIE>();
	}

	static void disable_update_interrupt()
	{
		clear_periph_reg_bit<TIM_DIER, TIM_DIER_UIE>();
	}

	static void clear_all_flags()
	{
		HL_UI32REG(TIM_SR) = 0;
		HL_UI32REG(TIM_SR);
	}

	static bool get_update_interrupt_flag()
	{
		return get_periph_reg_bit<TIM_SR, TIM_SR_UIF>();
	}

	static void clear_update_interrupt_flag()
	{
		HL_UI32REG(TIM_SR) = ~TIM_SR_UIF;
		HL_UI32REG(TIM_SR); // <- HACK to avoid the problem with race condition of twice ticks:
	}

	// TIMx_EGR ???

	static void set_counter(uint16_t value)
	{
		HL_UI32REG(TIM_CNT) = value;
	}

	static uint16_t get_counter()
	{
		return HL_UI32REG(TIM_CNT);
	}

	static void set_prescaler(uint16_t value)
	{
		HL_UI32REG(TIM_PSC) = value;
	}

	static uint16_t get_prescaler()
	{
		return HL_UI32REG(TIM_PSC);
	}

	static void set_auto_reload_value(uint16_t value)
	{
		HL_UI32REG(TIM_ARR) = value;
	}

	static uint16_t get_auto_reload_value()
	{
		return HL_UI32REG(TIM_ARR);
	}

protected:
	static constexpr uintptr_t tim = Helper::tim;

	static constexpr uintptr_t TIM_CR1  = tim + offsetof(TIM_TypeDef, CR1);
	static constexpr uintptr_t TIM_CR2  = tim + offsetof(TIM_TypeDef, CR2);
	static constexpr uintptr_t TIM_DIER = tim + offsetof(TIM_TypeDef, DIER);
	static constexpr uintptr_t TIM_SR   = tim + offsetof(TIM_TypeDef, SR);
	static constexpr uintptr_t TIM_SMCR = tim + offsetof(TIM_TypeDef, SMCR);
	static constexpr uintptr_t TIM_CCER = tim + offsetof(TIM_TypeDef, CCER);
	static constexpr uintptr_t TIM_CNT  = tim + offsetof(TIM_TypeDef, CNT);
	static constexpr uintptr_t TIM_PSC  = tim + offsetof(TIM_TypeDef, PSC);
	static constexpr uintptr_t TIM_ARR  = tim + offsetof(TIM_TypeDef, ARR);
	static constexpr uintptr_t TIM_EGR  = tim + offsetof(TIM_TypeDef, EGR);
};


///////////////////////////////////////////////////////////////////////////////

enum class TimerClockDivision
{
	_1 = 0 << 8,
	_2 = 1 << 8,
	_4 = 2 << 8,
};

enum class TimerAlign
{
	Edge    = 0 << 5,
	Center1 = 1 << 5,
	Center2 = 2 << 5,
	Center3 = 3 << 5,
};

enum class TimerDirection
{
	Up   = 0 << 4,
	Down = 1 << 4
};

enum class PWMMode
{
	_1 = 6 << 4,
	_2 = 7 << 4
};

enum class PWMPolarity
{
	High = 0 << 1,
	Low  = 1 << 1
};

enum class PWMPreload
{
	Disable = 0,
	Enable = TIM_CCMR1_OC1PE,
};

enum class ICPolarity
{
	Rising  = 0b000 << 1,
	Falling = 0b001 << 1,
	Both    = 0b101 << 1
};

enum class ICPrescaler
{
	No = 0b00 << 2,
	_2 = 0b01 << 2,
	_4 = 0b10 << 2,
	_8 = 0b11 << 2,
};

enum class ICFilter
{
	No    = 0b0000 << 4, // No filter, sampling is done at f DTS
	_1_2  = 0b0001 << 4, // f SAMPLING =f CK_INT , N=2
	_1_4  = 0b0010 << 4, //f SAMPLING =f CK_INT , N=4
	_1_8  = 0b0011 << 4, //f SAMPLING =f CK_INT , N=8
	_2_6  = 0b0100 << 4, //f SAMPLING =f DTS /2, N=6
	_2_8  = 0b0101 << 4, //f SAMPLING =f DTS /2, N=8
	_4_6  = 0b0110 << 4, //f SAMPLING =f DTS /4, N=6
	_4_8  = 0b0111 << 4, //f SAMPLING =f DTS /4, N=8
	_8_6  = 0b1000 << 4, //f SAMPLING =f DTS /8, N=6
	_8_8  = 0b1001 << 4, //f SAMPLING =f DTS /8, N=8
	_16_5 = 0b1010 << 4, //f SAMPLING =f DTS /16, N=5
	_16_6 = 0b1011 << 4, //f SAMPLING =f DTS /16, N=6
	_16_8 = 0b1100 << 4, //f SAMPLING =f DTS /16, N=8
	_32_5 = 0b1101 << 4, //f SAMPLING =f DTS /32, N=5
	_32_6 = 0b1110 << 4, //f SAMPLING =f DTS /32, N=6
	_32_8 = 0b1111 << 4, //f SAMPLING =f DTS /32, N=8
};

enum class ICChanMapping
{
	Same = 0b01 << 0,
	Near = 0b10 << 0,
	TRC  = 0b11 << 0,
};

// Slave modes

enum class SlaveMode
{
	Disable       = 0b000 << 0, // Slave mode disabled - if CEN = ‘1 then the prescaler is clocked directly by the internal clock.
	Encoder1      = 0b001 << 0, // Encoder mode 1 - Counter counts up/down on TI2FP2 edge depending on TI1FP1 level.
	Encoder2      = 0b010 << 0, // Encoder mode 2 - Counter counts up/down on TI1FP1 edge depending on TI2FP2 level.
	Encoder3      = 0b011 << 0, // Encoder mode 3 - Counter counts up/down on both TI1FP1 and TI2FP2 edges depending on the level of the other input.
	Reset         = 0b100 << 0, // Reset Mode - Rising edge of the selected trigger input (TRGI) reinitializes the counter and generates an update of the registers.
	Gated         = 0b101 << 0, // Gated Mode - The counter clock is enabled when the trigger input (TRGI) is high. The counter stops (but is not reset) as soon as the trigger becomes low. Both start and stop of the counter are controlled.
	Trigger       = 0b110 << 0, // Trigger Mode - The counter starts at a rising edge of the trigger TRGI (but it is not reset). Only the start of the counter is controlled.
	ExternalClock = 0b111 << 0, // External Clock Mode 1 - Rising edges of the selected trigger (TRGI) clock the counter.
};

// Slave mode triggers
enum class SlaveModeTrigger
{
	InternTrigger0      = 0b000 << 4, // Internal Trigger 0 (ITR0)
	InternTrigger1      = 0b001 << 4, // Internal Trigger 1 (ITR1)
	InternTrigger2      = 0b010 << 4, // Internal Trigger 2 (ITR2)
	InternTrigger3      = 0b011 << 4, // Internal Trigger 3 (ITR3)
	TI1EdgeDetector     = 0b100 << 4, // TI1 Edge Detector (TI1F_ED)
	FilteredTimerInput1 = 0b101 << 4, // Filtered Timer Input 1 (TI1FP1)
	FilteredTimerInput2 = 0b110 << 4, // Filtered Timer Input 2 (TI2FP2)
	ExternalTrigger     = 0b111 << 4, // External Trigger input (ETRF)
};


